Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/nbi-omegat.tmx
Source language: en_us
Languages: pt_br

source: The current platform is not supported.
pt_br: A plataforma atual não é suportada.

source: Could not load the engine properties file
pt_br: Não pode carregar o arquivo de propriedades do motor

source: Required parameter missing for command line argument "{0}".
pt_br: Faltando parametro obrigatório para argumento de linha de comando "{0}".

source: Should be "{0} <look-and-feel-class-name>".
pt_br: Deve ser "{0} <look-and-feel-class-name>".

source: Should be "{0} <target-component-uid> <target-component-version>".
pt_br: Deve ser "{0} <target-component-uid> <target-component-version>".

source: Invalid parameter for command line argument "{0}" -- "{1}".
pt_br: Parametro inválido para argumento de linha de comando "{0}" -- "{1}".

source: Should be "{0} <language>[_<country>[_<variant>]]".
pt_br: Deve ser "{0} <language>[_<country>[_<variant>]]".

source: The specified state file "{1}", does not exist.
pt_br: O arquivo de estado especificado "{1}", não existe.

source: "{0}" parameter is ignored.
pt_br: Parametro "{0}" ignorado.

source: Should be "{0} <state-file-path>".
pt_br: Deve ser "{0} <state-file-path>".

source: The specified state file "{1}", exists.
pt_br: O arquivo de estado especificado "{1}", existe.

source: The specified target file "{1}", exists.
pt_br: O arquivo de destino especificado "{1}", existe.

source: Should be "{0} <target-file-path>".
pt_br: Deve ser "{0} <target-file-path>".

source: Should be "{0} <userdir-path>".
pt_br: Deve ser "{0} <userdir-path>".

source: Should be "{0} <target-platform>".
pt_br: Deve ser "{0} <target-platform>".

source: Should be "{0} <remote-registry-url>".
pt_br: Deve ser "{0} <remote-registry-url>".

source: Should be "{0} <properties-file-path>".
pt_br: Deve ser "{0} <properties-file-path>".

source: Should be "{0} <bundle-properties-file-path>".
pt_br: Deve ser "{0} <bundle-properties-file-path>".

source: "{1}" option is required when using "{0}".
pt_br: Opção "{1}" é obrigatória quando utilizar "{0}".

source: "{0}" will be ignored.
pt_br: "{0}" será ignorado.

source: Cannot create local directory: {0}
pt_br: Não pode criar diretório local: {0}

source: Local directory exists and is a file: {0}
pt_br: O diretório local já existe e é um arquivo: {0}

source: Cannot read local directory - not enought permissions
pt_br: Não pode ler o diretório local - sem permissão

source: Cannot write to local directory - not enought permissions
pt_br: Não pode escrever no diretório local - sem premissão

source: NetBeans Installer is already running
pt_br: O Instalador do NetBeans já está em execução

source: It seems that another instance of the installer is already running.
pt_br: Uma outra instância do instalador já está em execução.

source: It is not recomended that you run multiple installers at the same time.
pt_br: Não é recomendado que você execute múltiplas instâncias do instalador ao mesmo tempo.

source: Do you still want to start another instance of the installer?
pt_br: Você ainda deseja iniciar outra instância do instalador?

source: Can't create lock for the local registry file
pt_br: Não pode criar trava para o arquivo de registro local

source: Failed to create the default Wizard instance.
pt_br: Falha criando a instância do Assistente padrão.

source: Failed to load wizard components from {0}, using classloader {1}.
pt_br: Falha ao carregar componentes do assistente de {0}, utilizando carregador de classes {1}.

source: Failed to load wizard component from XML element {0}, using classloader {1}.
pt_br: Falha ao carregar componentes do assistente do elemento XML {0}, utilizando carregador de classes {1}.

source: Failed to attach custom error handler to the EDT.
pt_br: Falha ao anexar maniputador de erros personalizado ao EDT.

source: Unknown UI mode - {0}.
pt_br: Mode UI desconhecido - {0}.

source: Cannot move backward in silent UI mode.
pt_br: Não pode voltar em modo UI silencioso.

source: Cannot move backward - the wizard is already at the first element.
pt_br: Não pode voltar - o assistente já está no primeiro elemento.

source: The current parser - {0} - does not support schemas.
pt_br: O processador atual - {0} - não suporta esquemas.

source: Interrupted while waiting
pt_br: Interrompido enquando aguardava

source: NetBeans IDE Installer
pt_br: Instalador do IDE NetBeans

source: NetBeans IDE Installer Description
pt_br: Descrição do instalador do IDE NetBeans

source: &Help!
pt_br: Aj&uda!

source: < &Back
pt_br: < &Voltar

source: &Next >
pt_br: Próxi&mo >

source: Cancel
pt_br: Cancelar

source: &Finish
pt_br: &Finalizar

source: Are you sure you want to cancel?
pt_br: Deseja realmente cancelar?

source: An InterruptedException occured.
pt_br: Ocorreu uma InterruptedException.

source: Canceling, finishing the current operation...
pt_br: Cancelando, terminando a operação atual...

source: &Location:
pt_br: &Localização:

source: B&rowse ...
pt_br: Navegado&r ...

source: The &following locations were found by the search algorithm:
pt_br: As localizações a seguir &foram encontradas pelo algorítimo de bsuca:

source: No compatible applications were found.
pt_br: Nenhuma aplicação compatível foi encontrada.

source: Components Selection
pt_br: Seleção dos componentes

source: Select the components that you want to install.
pt_br: Marque os componentes que você deseja instalar.

source: Unselect those you want to uninstall.
pt_br: Desmarque aquels que você deseja desinstalar.

source: Unselect the components that you want to uninstall.
pt_br: Desmarque os componentes que você deseja desinstalar.

source: Feature Description
pt_br: Descrição da característica

source: text/plain
pt_br: texto/puro

source: Installation size: {0} Download Size: {1}
pt_br: Tamanho da instalação: {0} Tamanho do download: {1}

source: Installation size: {0}
pt_br: Tamanho da instalação: {0}

source: No feature selected.
pt_br: Nenhuma característica selecionada...

source: Select at least one feature for installation or uninstallation.
pt_br: Selecione ao menos uma característica para isntalação ou desinstalação.

source: Select at least one feature for installation.
pt_br: Selecine ao menos uma característica para instalação.

source: Select at least one feature for uninstallation.
pt_br: Selecione ao menos uma característica para desinstalação.

source: {1} is required to install {0}.
pt_br: {1} é obrigatório instalar {0}.

source: {0} conflicts with {1}.
pt_br: {0} conflito com {1}.

source: {0} is required by {1}.
pt_br: {0} é requerido por {1}.

source: Insufficient disk space for downloading the installation data.
pt_br: Espaço em disco insuficiente para fazer download dos dados para instalação.

source: Additional {1} is required in {0}.
pt_br: Adicional {1} é requerido em {0}.

source: Insufficient disk space for extracting the installation data.
pt_br: Espaço em disco insuficiente para extrair dados da instalação.

source: Cannot check the free disk space
pt_br: Não pode checar o espaço em disco livre

source: Installation Folder
pt_br: Pasta de instalação

source: Choose destination folder.
pt_br: Escolha a pasta de destino.

source: &Installation location:
pt_br: Local&ização da instalação:

source: The installation folder cannot be empty.
pt_br: A pasta de instalação não pode ser limpa.

source: The specified installation folder is invalid.
pt_br: A pasta de instalação especificada é inválida.

source: The installation folder cannot contain the exclamation mark (!).
pt_br: A pasta de instalação não pode conter uma marca de exclamação (!).

source: The specified installation folder has to be in absolute path form.
pt_br: A pasta de instalação especificada tem que ser em forma de caminho absoluto.

source: The specified installation folder cannot be canonized.
pt_br: A pasta de instalação especificada não pode ser canonizada.

source: The specified installation location is not a folder.
pt_br: O local de instalação especificado não é uma pasta.

source: The specified installation folder is not readable.
pt_br: A pasta de instalação especificada não pode ser lida.

source: The specified installation folder is read-only.
pt_br: A pasta de instalação especificada é somente-leitura.

source: The specified installation folder is not empty.
pt_br: A pasta de instalação especificada não está vazia.

source: The specified installation folder must end with ".app".
pt_br: A pasta de instalação especificada deve terminar com ".app".

source: Not enough disk space.
pt_br: Sem espaço em disco suficiente.

source: Additional {1} required in {0}.
pt_br: Adicional {1} requerido em {0}.

source: Cannot obtain confguration logic
pt_br: Não pode obter lógica de configuração

source: Features Setup
pt_br: Configuração de características

source: Select the program features that you want to install.
pt_br: Selecione as características do programa que você deseja instalar.

source: Features Setup:
pt_br: Configuração de características:

source: <html>Desktop <span color="gray">(includes JDK 6)</span></html>
pt_br: <html>Desktop <span color="gray">(inclui JDK 6)</span></html>

source: <html>Web <span color="gray">(includes JDK 6 and GlassFish)</span></html>
pt_br: <html>Web <span color="gray">(inclui JDK 6 e GlassFish)</span></html>

source: <html>Mobility <span color="gray">(includes JDK 6)</span></html>
pt_br: <html>Mobilidade <span color="gray">(inclui JDK 6)</span></html>

source: <html>C/C++ <span color="gray">(includes JDK 6 - required for NetBeans IDE)</span></html>
pt_br: <html>C/C++ <span color="gray">(inclui JDK 6 - requerido para o IDE NetBeans)</span></html>

source: <html>Enterprise <span color="gray">(all of the above plus EJB, SOA, UML and Collaboration)</span></html>
pt_br: <html>Enterprise <span color="gray">(todos incluem EJB, SOA, UML e Colaboração)</span></html>

source: Custom
pt_br: Personalizado

source: Each feature setup contains the essential NetBeans tools - textual and visual editors, debugger, profiler, testing, versioning and database support.
pt_br: Cada configuração de característica contém as ferramentas essenciais do NetBeans - suporte à editores textuais e visuais, depurador, profiler, teste, versionamento e banco de dados

source: You can add or remove features later using the NetBeans plugin center available in NetBeans IDE.
pt_br: Você pode adicionar ou remover características depois usando a central de plugin do NetBeans disponível no IDE NetBeans.

source: &JDK Home Folder:
pt_br: Pasta HOME do &JDK:

source: &List of suitable JDKs found on this machine:
pt_br: &Lista de JDKs encontrado nesta máquina:

source: The path to the JDK cannot be empty.
pt_br: O caminho para o JDK não pode ser vazio.

source: The specified JDK folder {0} is invalid.
pt_br: A pasta do JDK especificada {0} é inválida.

source: The specified JDK folder {0} does not exist.
pt_br: A pasta do JDK especificada {0} não existe.

source: The specified JDK folder {0} does not contain JDK.
pt_br: A pasta do JDK especificada {0} não contém JDK.

source: The specified JDK folder {0} contains JRE, but a full JDK is required.
pt_br: A pasta do JDK especificada {0} contém o JRE, mas um JDK completo é requerido.

source: The specified JDK folder {0} contains JDK version "{1}", while the minimum is JDK "{2}".
pt_br: A pasta JDK especificada {0} contém o JDK versão "{1}", mas o mínimo é "{2}".

source: The specified JDK folder {0} contains JDK version "{1}", while the maximum is JDK "{2}".
pt_br: A pasta JDK especificada {0} contém o JDK versão "{1}", mas o máximo é "{2}".

source: The specified JDK folder {0} contains JDK from the unsupported vendor ({1}).
pt_br: A pasta JDK especificada {0} contém o JDK de um fornecedor não suportado ({1}).

source: The supported vendors are "{2}".
pt_br: Os fornecedores suportados são "{2}".

source: An unknown error occured while validating the path.
pt_br: Um erro desconhecido ocorreu ao validar o caminho.

source: The installer could not find a compatible JDK installation.
pt_br: O instalador não pode encontrar uma instalação do JDK compatível.

source: The minimum required version is {0}.
pt_br: A versão mínima requerida é {0}.

source: Specify JDK folder manually.
pt_br: Especifique manualmente a pasta JDK.

source: {0} (used by {1})
pt_br: {0} (usado por {1})

source: Please review the license agreements for the selected components.
pt_br: Revise o acordo de licença para os componentes selecionados.

source: I &accept the terms of the license agreements
pt_br: Eu &aceito os termos do acordo de licença

source: Installation Wizard - Select Components
pt_br: Assistente de instalação - Selecionar componentes

source: Please select the components you want to install.
pt_br: Selecione os componentes que você deseja instalar.

source: Unselect those that you plan to uninstall.
pt_br: Desmarque aqueles que você planeja desinstalar.

source: This component requires: {0}
pt_br: Este componente requer: {0}

source: This component conflicts with: {0}
pt_br: Este componente está em conflito com: {0}

source: Total Download Size: {0}
pt_br: Tamanho total do download: {0}

source: Total Required Disk Space: {0}
pt_br: Total de espaço em disco necessário: {0}

source: <No Component Selected>
pt_br: <Nenhum componente selecionado>

source: You did not select anything to install or uninstall.
pt_br: Você não selecionou nada para instalar ou desinstalar.

source: {1} is required to install component {0}.
pt_br: {1} é requerido para instalar o componente {0}.

source: Please select it.
pt_br: Por favor selecione.

source: Please unselect it.
pt_br: Por favor desmaque.

source: {0} is required by component {1}.
pt_br: {0} é requerido pelo componente {1}.

source: Post-Create Bundle Summary
pt_br: Resumo do Pacote Pós-Criação

source: The installation wizard has successfully performed the selected actions.
pt_br: O assistente de instalação executou com sucesso as ações selecionadas.

source: Some errors were encountered in the course of bundle creation process.
pt_br: Alguns erros foram encontrados no curso do processo de criação do pacote.

source: The following components were successfully bundled:
pt_br: Os componentes a seguir foram empacotados com sucesso:

source: The following components failed to be bundled:
pt_br: Os componentes a seguir falharam a serem empacotados:

source: View &Log
pt_br: Visualizar &log

source: &Send Log
pt_br: &Enviar Log

source: Installation Wizard - Post-Install Summary
pt_br: Assistente de instalação - Resumo de Pós-Instalação

source: Some warnings were encountered in the course of installation/uninstallation process.
pt_br: Alguns avisos foram encontrados no curso do processo de instalação/desinstalação.

source: Some errors were encountered in the course of installation/uninstallation process.
pt_br: Alguns erros foram encontrados no curso do processo de instalação/desinstalação.

source: The following components were successfully installed:
pt_br: Os componentes a seguir foram instalados com sucesso:

source: The following components installed with warnings:
pt_br: Os componentes a seguir foram instalados com avisos:

source: The following components failed to install:
pt_br: Os componentes a seguir falharam ao instalar:

source: The following components were successfully uninstalled:
pt_br: Os componentes a seguir foram desinstalados com sucesso:

source: The following components uninstalled with warnings:
pt_br: Os componentes a seguir foram desinstalados com avisos:

source: The following components failed to uninstall:
pt_br: Os componentes a seguir falharam ao desinstalar:

source: View &Details
pt_br: Visualizar &detalhes

source: Log file is not available
pt_br: Arquivo de log não disponível

source: Some files could not be removed from the installation directories of the {0}.
pt_br: Alguns arquivos não puderam ser removidos dos diretórios de instalação do {0}.

source: You may need to remove them manually.
pt_br: Você deve remover manualmente.

source: Pre-Create Bundle Summary
pt_br: Resumo do Pacote Pre-Criação

source: The wizard has collected all required data to proceed with creating of the bundle.
pt_br: O assistente coletou todos os dados requeridos para continuar com a criação do pacote.

source: Please review your choice.
pt_br: Por favor, revise suas escolhas.

source: To continue, click Next.
pt_br: Para continuar, clique Próximo.

source: You chose to create a bundle with the following components:
pt_br: Você escolheu criar um pacote com os componentes a seguir:

source: Total download size: {0}
pt_br: Tamanho total do download: {0}

source: Required disk space: {0}
pt_br: Espaço em disco necessário: {0}

source: &Create
pt_br: &Criar

source: Pre-Install Summary
pt_br: Resumo Pre-Instalação

source: The installation wizard has collected all required data to proceed with installation/uninstallation of the selected components.
pt_br: O assistente coletou todos os dados requeridos para continuar com a instalação/desinstalação dos componentes selecionados.

source: You chose to install the following components:
pt_br: Você escolheu instalar os componentes a seguir:

source: You chose to uninstall the following components:
pt_br: Você escolheu desinstalar os componentes a seguir:

source: &Install
pt_br: &Instalar

source: Insufficient disk space for proper installation.
pt_br: Espaço em disco insuficiente para instalação.

source: Could not access product's configuration logic
pt_br: Não pode acessar lógica de configuração do produto

source: Cannot get the list of file system roots
pt_br: Não pode receber a lista de raízes do sistema de arquivo

source: {0} is set up to be installed to {1} which does not belong to any of the file system roots.
pt_br: {0} está configurado para ser instalado em {1} o qual não pertence à nenhuma raiz do sistema de arquivo.

source: The wizard does not have write access to {1}, the instalaltion directory of {0}.
pt_br: O assistente não tem acesso de escrita em {1}, o diretório de instalação de {0}.

source: Please correct the permissions before proceeding.
pt_br: Corrija as permissões antes de continuar.

source: License Agreement
pt_br: Acordo de Licença

source: Please read the following license agreement carefully.
pt_br: Por favor, leia o acordo de licença a seguir atentamente.

source: I &accept the terms in the license agreement
pt_br: Eu &aceito os termos no acordo de licença

source: Could not access configuration logic
pt_br: Não pode acessar a lógica de configuração

source: <No Text>
pt_br: <Sem texto>

source: Failed to verify input
pt_br: Falhou verificando entrada

source: Cache Engine...
pt_br: Mecanismo de cache...

source: Please wait while the wizard caches the engine.
pt_br: Aguarde enquanto o assistente armazena o mecanismo.

source: Cannot cache the installer engine
pt_br: Não pode armazenar o mecanismo do instalador

source: Creating Bundle...
pt_br: Criando pacote...

source: Please wait while the wizard creates a bundle with the selected components.
pt_br: Aguarde enquanto o assistente cria um pacote com os componentes selecionados.

source: Creating a redistributable bundle at {0}
pt_br: Criando um pacote de distribuição em {0}

source: Add installer engine to the bundle
pt_br: Adicionar o mecanismo do instalador ao pacote

source: Adding {0} ...
pt_br: Adicionando {0} ...

source: Failed to create the bundle
pt_br: Falhou ao criar o pacote

source: Creating Native Launcher...
pt_br: Criando lançador nativo...

source: Please wait while the wizard creates a launcher for the jar file.
pt_br: Aguarde enquanto o assistente cria um lançador para o arquivo jar.

source: Failed to create the native launcher
pt_br: Falhou ao criar o lançador nativo

source: Creating MacOSX Application Launcher...
pt_br: Criando lançador de aplicação MacOSX...

source: Please wait while the wizard creates a app launcher for the jar file.
pt_br: Aguarde enquanto o assistente cria um lançador de aplicação para o arquivo jar.

source: Failed to create the app launcher
pt_br: Falhou ao criar o lançador de aplicativo

source: Preparing Configuration Logic...
pt_br: Preparando a lógica de configuração...

source: Please wait while the wizard prepares the configuration logic.
pt_br: Aguarde enquanto o assistente prepara a lógica de configuração.

source: Downloading configuration logic for {0}
pt_br: Fazendo download da lógica de configuração para {0}

source: Extracting configuration logic for {0}
pt_br: Extraindo lógica de configuração para {0}

source: Failed to download installation logic for {0}
pt_br: Falhou ao fazer download da lógica de configuração para {0}

source: Could not install {0}, since the installation of {1} failed
pt_br: Não pode instalar {0}, uma vez que a instalação {1} falhou

source: Preparing Installation Data...
pt_br: Preparando dados para instalação...

source: Please wait while the wizard prepares the installation data.
pt_br: Aguarde enquanto o assistente prepara os dados para instalação.

source: Downloading installation data for {0}
pt_br: Fazendo download dos dados para instalação de {0}

source: Extracting installation data for {0}
pt_br: Extraindo os dados para instalação de {0}

source: Failed to download installation data for {0}
pt_br: Falhou ao fazer download dos dados para instalação de {0}

source: Initializing...
pt_br: Inicializando...

source: Please wait while the setup wizard initializes.
pt_br: Aguarde enquanto o assistente de configuração inicializa.

source: Cannot initialize registry
pt_br: Não pode inicializar registro

source: Finalizing...
pt_br: Finalizando...

source: Please wait while the setup wizard finilizes.
pt_br: Aguarde enquanto o assinstente de configuração finaliza.

source: Cannot finalize registry
pt_br: Não pode finalizar registro

source: Installing...
pt_br: Instalando...

source: Please wait while the wizard installs the selected components.
pt_br: Aguarde enquanto o assistente instala os componentes selecionados.

source: Installing {0}...
pt_br: Instalando {0}...

source: Canceling, rolling back {0}...
pt_br: Cancelando, desfazendo {0}...

source: Unknown Error
pt_br: Erro desconhecido

source: Searching for Java™ Installations...
pt_br: Procurando por instalações do Java™...

source: Please wait while the wizard searches your system for existing Java™ installations.
pt_br: Aguarde enquanto o assistente procura em seu sistema por instalações do Java™ existentes.

source: Preparing locations list...
pt_br: Preparando lista de locais...

source: Checking {0}
pt_br: Verificando {0}

source: Searching for installed JDKs...
pt_br: Procurando por JDKs instaladas...

source: {1} by {2})
pt_br: {1} por {2})

source: {1} <span color="red">(non-final)</span> by {2})</span></html>
pt_br: {1} <span color="red">(non-final)</span> por {2})</span></html>

source: Uninstalling...
pt_br: Desinstalando...

source: Please wait while the wizard uninstalls the selected components.
pt_br: Aguarde enquanto o assistente desinstala os componentes selecionados.

source: Uninstalling {0}
pt_br: Desinstalando {0}

source: Could not uninstall {0}, since the uninstallation of {1} failed
pt_br: Não pode desinstalar {0}, uma vez que a desinstalação de {1} falhou

source: Source component UID is not set
pt_br: Fonte do componente UID não definido

source: Component with the given uid {0} does not exist
pt_br: Componente com o uid fornecido {0} não existe

source: Could not access configuration logic for {0}
pt_br: Não pode acessar lógica de configuração para {0}

source: A terrible and weird error happened - installer's execution mode is not recognized
pt_br: Um erro terrível ocorreu - o modo de execução do instalador irreconhecível

source: Installation details
pt_br: Detalhes de instalação

source: Component
pt_br: Componente

source: Status
pt_br: Situação

source: Loading log file.
pt_br: Carregando arquivo de log.
